---
kind: other
id: Properties.T:Autodesk.Revit.DB.FaceNode
source: html/a25d9bf8-6996-d546-279d-231cc5d78984.htm
---
# FaceNode Properties

Specifies whether the .NET object represents a valid Revit entity.